0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 3.98106e-07;

boundaryField
{
    side1
    {
        type            empty;
    }
    side2
    {
        type            empty;
    }
    outFlow
    {
        type            zeroGradient;
    }
    airfoil
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    inFlow
    {
        type            inletOutlet;
        inletValue      uniform 3.98106e-07;
        value           uniform 3.98106e-07;
    }
}


// ************************************************************************* //
